# Cápitulo 03 - Arquivo 01

In [1]:
# Importando bibliotecas e imprimir versão:
from platform import python_version
print('Versão Python:', python_version(), '\n')

import pandas as pd

%reload_ext watermark
%watermark -a "gustavogzr" --iversions

Versão Python: 3.11.1

Author: gustavogzr

pandas: 2.0.3

In [2]:
df = pd.read_csv('.arquivos_DSA/dados/dataset1.csv') # Importando o dataset

In [3]:
type(df) # Tipo do objeto

pandas.core.frame.DataFrame

In [4]:
df.shape # Dimensões do dataset

(615, 6)

In [5]:
df.size # Tamanho do dataset

3690

In [6]:
df.head(10) # Visualizando as 10 primeiras linhas

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [7]:
df.tail(10) # Visualizando as 10 últimas linhas

    club last_name first_name position  base_salary  guaranteed_compensation
605  VAN   Rosales      Mauro        M      65004.0                 65004.00
606  VAN    Seiler       Cole        D      54075.0                 54075.00
607  VAN      Shea       Brek      M-D     625000.0                670000.00
608  VAN    Tchani       Tony        M     275000.0                308333.33
609  VAN   Techera   Cristian        M     352000.0                377000.00
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

In [8]:
df.info() # Informações sobre o dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [9]:
df.describe() # Estatísticas descritivas

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [14]:
# Contar número de valores NaN em cada coluna
df.isnull().sum()

club                        1
last_name                   1
first_name                  5
position                   11
base_salary                 1
guaranteed_compensation     1
dtype: int64